In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("C:\\code+lab\\Pyhton_Lab\\100Days_Python\\Sample_Data\\salaries_by_college_major.csv")

In [9]:
df.head() # this gives the top 5 rows of the data frame

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [10]:
df.shape # this gives the number of rows and columns in the dataframe

(51, 6)

In [18]:
df.columns #this gives the column names in the data frame

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [1]:
df.isna()
#df.isna() # to identify the NAN (not a number values) in the data frame -- nan values are blank cells or cells with strings and it shows true for nan

NameError: name 'df' is not defined

In [15]:
df.tail() # this gives the last 5 rows of the data frame

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [19]:
# df.dorpna() -- this drops the rows with nan 
clean_df=df.dropna() # assigning the transformed df a new name
clean_df.tail() # this is to verify if it is dropped or not

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [20]:
clean_df['Starting Median Salary'] # to access a particular column of the data frame

0     46000.0
1     57700.0
2     42600.0
3     36800.0
4     41600.0
5     35800.0
6     38800.0
7     43000.0
8     63200.0
9     42600.0
10    53900.0
11    38100.0
12    61400.0
13    55900.0
14    53700.0
15    35000.0
16    35900.0
17    50100.0
18    34900.0
19    60900.0
20    38000.0
21    37900.0
22    47900.0
23    39100.0
24    41200.0
25    43500.0
26    35700.0
27    38800.0
28    39200.0
29    37800.0
30    57700.0
31    49100.0
32    36100.0
33    40900.0
34    35600.0
35    49200.0
36    40800.0
37    45400.0
38    57900.0
39    35900.0
40    54200.0
41    39900.0
42    39900.0
43    74300.0
44    50300.0
45    40800.0
46    35900.0
47    34100.0
48    36500.0
49    34000.0
Name: Starting Median Salary, dtype: float64

In [21]:
clean_df['Starting Median Salary'].max() # to find the highest value in the column

74300.0

In [22]:
clean_df['Starting Median Salary'].idxmax() # to give the index of the row with highest value

43

In [23]:
# lets find out which undergraduate major gives this salary , for this we need to use the index we got above, with the location function
clean_df['Undergraduate Major'].loc[43] # this fetches the undergraduate major at the location,index 43

'Physician Assistant'

In [25]:
# the same thing as above can be achived with out using the loc function
clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [26]:
#If you don't specify a particular column you can use the .loc property to retrieve an entire row:
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [33]:
#What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).
i=clean_df['Mid-Career Median Salary'].idxmax()
print(f"the index of the highest mid career salary is :{i}") # assigning the index for the max value to i
print(f"the highest mid career salary is:{clean_df['Mid-Career Median Salary'][i]}") # gives the salary at the index i
print(f"the undergraduate major with the highest mid career salary is : {clean_df['Undergraduate Major'][i]}") # gives the under graduate major at the index i

the index of the highest mid career salary is :8
the highest mid career salary is:107000.0
the undergraduate major with the highest mid career salary is : Chemical Engineering

In [35]:
#Which college major has the lowest starting salary and how much do graduates earn after university?
i=clean_df['Starting Median Salary'].idxmin()
print(f"the index of the lowest starting salary is :{i}")
print(f"the lowest salary is : {clean_df['Starting Median Salary'][i]}")
print(f"the under graduate major with the lowest salary : {clean_df['Undergraduate Major'][i]}")

the index of the lowest starting salary is :49
the lowest salary is : 34000.0
the under graduate major with the lowest salary : Spanish

In [37]:
# Which college major has the lowest mid-career salary and how much can people expect to earn with this degree? 
i=clean_df['Mid-Career Median Salary'].idxmin()
print(f"the index of the lowest mid career salary is: {i}")
print(f"people expect to make : {clean_df['Mid-Career Median Salary'][i]}")
print(f"the undergraduate major is : {clean_df['Undergraduate Major'][i]}")

the index of the lowest mid career salary is: 18
people expect to make : 52000.0
the undergraduate major is : Education

In [ ]:
"""A low-risk major is a degree where there is a small difference between the lowest and highest salaries. 
In other words, if the difference between the 10th percentile and the 90th percentile earnings of your major is small, then you can be 
more certain about your salary after you graduate.How would we calculate the difference between the earnings of the 10th and 90th percentile? 
Well, Pandas allows us to do simple arithmetic with entire columns, so all we need to do is take the difference between the two columns:"""

#clean_df['Mid-Career 90th Percentile Salary']-clean_df['Mid-Career 10th Percentile Salary'] to find the difference b/w the columns
# or clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary']) 

spread_col=clean_df['Mid-Career 90th Percentile Salary']-clean_df['Mid-Career 10th Percentile Salary'] # assigning the diff 
clean_df.insert(1,'spread',spread_col) # this inserts a new column spresd at the 1st position note (index ->0,1,2...) , with the data from spread_col

In [41]:
clean_df.head() # to check the top 5 rows

,Undergraduate Major,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [50]:
# lets sort the spread 
low_risk = clean_df.sort_values('spread') # for sorting the column values (ascending by default)
low_risk[['Undergraduate Major','spread']].head() # for particular multiple columns

#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html --- for more documentation on sorting

           Undergraduate Major   spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [54]:
#can you find the degrees with the highest potential? Find the top 5 degrees with the highest values in the 90th percentile. 
high_potential=clean_df.sort_values('Mid-Career 90th Percentile Salary',ascending=False)
high_potential[['Undergraduate Major','Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [58]:
#find the degrees with the greatest spread in salaries. Which majors have the largest difference between high and low earners after graduation.
great_spread=clean_df.sort_values('spread',ascending=False)
great_spread[['Undergraduate Major','spread']].head()

   Undergraduate Major    spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [61]:
#degrees where the median salary is very high  --- its intresting to compare this result with the above two.
high_median=clean_df.sort_values('Mid-Career Median Salary',ascending=False) 
high_median[['Undergraduate Major','Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

In [63]:
#group by and count

clean_df.groupby('Group').count()  # this groups  the group column and then counts similar to the group by in sql and excel pivot

,Undergraduate Major,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [77]:
# mean--average
clean_df.groupby('Group')['Mid-Career Median Salary'].mean() #this gives the mean of median salaries in each group
# we can get the medians for all columns at once

Group
Business    75083.333333
HASS        62968.181818
STEM        90812.500000
Name: Mid-Career Median Salary, dtype: float64

In [79]:

rm_df = clean_df.drop('Undergraduate Major', axis=1) # to drop the column Undergraduate Major as it is a stringtype
rm_df.head()
rm_df.groupby('Group').mean()# finds hte mean for  all the columns

,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

In [81]:
# the formating of numbers , decmal points
pd.options.display.float_format = '{:,.2f}'.format # for two decimals

rm_df = clean_df.drop('Undergraduate Major', axis=1) # to drop the column Undergraduate Major as it is a stringtype
rm_df.head()
rm_df.groupby('Group').mean()# finds hte mean for  all the columns

,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

In [ ]:
"""Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.

You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

You can sort the DataFrame with .sort_values() and add new columns with .insert()

To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method"""